contosoCrafts/wrk2/t1c1d15.txt
Running 15s test @ http://localhost:9090/Products
  1 threads and 1 connections
  Thread calibration: mean lat.: 2195.725ms, rate sampling interval: 7704ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.35s   616.66ms   6.42s    58.08%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.36s 
 75.000%    5.88s 
 90.000%    6.22s 
 99.000%    6.40s 
 99.900%    6.42s 
 99.990%    6.42s 
 99.999%    6.42s 
100.000%    6.42s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4304.895     0.000000            7         1.00
    4509.695     0.100000          586         1.11
    4710.399     0.200000         1159         1.25
    4907.007     0.300000         1728         1.43
    5152.767     0.400000         2304         1.67
    5361.663     0.500000         2877         2.00
    5468.159     0.550000         3170         2.22
    5570.559     0.600000         3463         2.50
    5672.959     0.650000         3747         2.86
    5771.263     0.700000         4034         3.33
    5877.759     0.750000         4326         4.00
    5922.815     0.775000         4463         4.44
    5984.255     0.800000         4606         5.00
    6057.983     0.825000         4755         5.71
    6115.327     0.850000         4893         6.67
    6164.479     0.875000         5036         8.00
    6197.247     0.887500         5108         8.89
    6221.823     0.900000         5184        10.00
    6250.495     0.912500         5261        11.43
    6275.071     0.925000         5336        13.33
    6295.551     0.937500         5395        16.00
    6311.935     0.943750         5438        17.78
    6324.223     0.950000         5476        20.00
    6336.511     0.956250         5511        22.86
    6348.799     0.962500         5550        26.67
    6356.991     0.968750         5576        32.00
    6365.183     0.971875         5601        35.56
    6369.279     0.975000         5613        40.00
    6377.471     0.978125         5630        45.71
    6385.663     0.981250         5654        53.33
    6389.759     0.984375         5667        64.00
    6393.855     0.985938         5680        71.11
    6397.951     0.987500         5692        80.00
    6397.951     0.989062         5692        91.43
    6402.047     0.990625         5705       106.67
    6406.143     0.992188         5718       128.00
    6406.143     0.992969         5718       142.22
    6410.239     0.993750         5730       160.00
    6410.239     0.994531         5730       182.86
    6410.239     0.995313         5730       213.33
    6414.335     0.996094         5741       256.00
    6414.335     0.996484         5741       284.44
    6414.335     0.996875         5741       320.00
    6414.335     0.997266         5741       365.71
    6414.335     0.997656         5741       426.67
    6418.431     0.998047         5753       512.00
    6418.431     0.998242         5753       568.89
    6418.431     0.998437         5753       640.00
    6418.431     0.998633         5753       731.43
    6418.431     0.998828         5753       853.33
    6418.431     0.999023         5753      1024.00
    6418.431     0.999121         5753      1137.78
    6418.431     0.999219         5753      1280.00
    6418.431     0.999316         5753      1462.86
    6418.431     0.999414         5753      1706.67
    6418.431     0.999512         5753      2048.00
    6418.431     0.999561         5753      2275.56
    6418.431     0.999609         5753      2560.00
    6418.431     0.999658         5753      2925.71
    6418.431     0.999707         5753      3413.33
    6418.431     0.999756         5753      4096.00
    6418.431     0.999780         5753      4551.11
    6418.431     0.999805         5753      5120.00
    6422.527     0.999829         5754      5851.43
    6422.527     1.000000         5754          inf
#[Mean    =     5353.562, StdDeviation   =      616.657]
#[Max     =     6418.432, Total count    =         5754]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17163 requests in 15.00s, 96.54MB read
Requests/sec:   1144.19
Transfer/sec:      6.44MB
4300800.000000,5353562.405283,6418432.000000,0,0,0