contosoCrafts/wrk2/t1d15R10.txt
Running 15s test @ http://localhost:9090/Products
  1 threads and 100 connections
  Thread calibration: mean lat.: 587.553ms, rate sampling interval: 1246ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.71ms    5.30ms  27.73ms   73.00%
    Req/Sec    20.00     34.64    80.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   23.23ms
 75.000%   25.22ms
 90.000%   25.66ms
 99.000%   26.30ms
 99.900%   27.74ms
 99.990%   27.74ms
 99.999%   27.74ms
100.000%   27.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       9.375     0.000000            1         1.00
      11.407     0.100000           10         1.11
      15.223     0.200000           20         1.25
      15.943     0.300000           30         1.43
      22.575     0.400000           40         1.67
      23.231     0.500000           50         2.00
      23.423     0.550000           55         2.22
      23.775     0.600000           60         2.50
      24.191     0.650000           65         2.86
      24.879     0.700000           70         3.33
      25.215     0.750000           76         4.00
      25.311     0.775000           78         4.44
      25.391     0.800000           80         5.00
      25.487     0.825000           83         5.71
      25.503     0.850000           85         6.67
      25.551     0.875000           88         8.00
      25.615     0.887500           89         8.89
      25.663     0.900000           90        10.00
      25.935     0.912500           94        11.43
      25.935     0.925000           94        13.33
      25.935     0.937500           94        16.00
      25.983     0.943750           95        17.78
      25.983     0.950000           95        20.00
      25.999     0.956250           96        22.86
      26.111     0.962500           97        26.67
      26.111     0.968750           97        32.00
      26.255     0.971875           98        35.56
      26.255     0.975000           98        40.00
      26.255     0.978125           98        45.71
      26.303     0.981250           99        53.33
      26.303     0.984375           99        64.00
      26.303     0.985938           99        71.11
      26.303     0.987500           99        80.00
      26.303     0.989062           99        91.43
      27.743     0.990625          100       106.67
      27.743     1.000000          100          inf
#[Mean    =       20.713, StdDeviation   =        5.303]
#[Max     =       27.728, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  200 requests in 16.51s, 1.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 600
Requests/sec:     12.12
Transfer/sec:     69.78KB
9368.000000,20713.360000,27728.000000,0,600,0